---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.PipeInsulationType
source: html/d143dc95-616f-ff2d-45e6-eeba658c2578.htm
---
# PipeInsulationType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.